Repository: oscarahalvorsen/masterproject
Catalog: maalfrid/tmx/udir.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: different optional quality development tools and
nb: Kandidatnummeret finnes i PAS.

source: do calculations using different measurement units and measuring tools, and analyse the precision of measurement accuracy and assess how uncertain the measurement are
nb: regne med ulike måleenheter, bruke ulike måleredskaper, vurdere hvilke måleredskaper som er hensiktsmessige, og vurdere måleusikkerheten

source: Digital media brings new possibilities for communication and dialogue about religion and philosophies of life.
nb: Digitale medier gir nye muligheter for kommunikasjon og dialog om religioner og livssyn.

source: use a truck in accordance with relevant regulations
nb: bruke truck i henhold til gjeldende regelverk

source: Some five-year-olds showed mixed feelings.
nb: • Noen femåringer forteller om blandede følelser.

source: write creative, informative and expository texts, literary analyses and rhetorical analyses in Bokmål and Nynorsk based on texts relevant to the curriculum
nb: skrive formelle og uformelle tekster med god struktur og sammenheng om personlige, tverrfaglige og samfunnsmessige temaer

source: Marketing and management 1
nb: For Markedsføring og ledelse 1 Hovedområdet

source: For all subjects in the national curriculum, there are national
nb: I alle faga i den nasjonale læreplanen er kriteria for å vurdere

source: ”It is not necessarily interaction, just because many children crowd together around a computer.’
nb: – Det er ikke nødvendigvis et samspill, en interaksjon, ved at mange barn står sammen rundt en datamaskin.

source: compare and convert whole numbers, decimal numbers, fractions, percentages, per thousandths and express such figures in various ways, and evaluate situations where the different representations are suitable
nb: sammenligne og regne om mellom hele tall, desimaltall, brøker, prosent, promille og tall på standardform, uttrykke slike tall på varierte måter og vurdere i hvilke situasjoner ulike representasjoner er hensiktsmessige

source: Emilson mentions an example:
nb: Emilson nevner et eksempel:

source: in the first place.
nb: økt behov for nærhet og trygghet

source: The main subject area Social science working methods deals with how social science researchers work, and with methodological and ethical questions relating to research.
nb: handler om hvordan samfunnsforskeren arbeider, og om metodiske og etiske problemer knyttet til forskningen.

source: read and discuss and elaborate on a representative selection of texts in Finnish from various genres, epochs and language areas
nb: gjøre rede for hvordan verdier, tenkemåter og forestillinger framstilles i norske og oversatte tekster fra samisk og andre kulturer

source: The main subject area is concerned with current research within the geosciences.
nb: Hovedområdet handler om aktuell forskning i geofag.

source: It is first and foremost symptomatic individuals who are contagious and the virus is most infectious when a
nb: Det er først og fremst personer med symptomer som er smittsomme, og smittsomheten er størst idet

source: “There is little doubt that the evaluation tools spreading in the kindergartens, can be useful.
nb: – Det er liten tvil om at kartlegg­ingsverktøyene som nå brer om seg i barnehagene, har noe for seg.

source: New media and the development of a linguistic repertoire across subjects and topics are an important part of this main area.
nb: Nye medier og utvikling av et språklig repertoar på tvers av fag og emner er sentrale i hovedområdet.

source: read and talk about English-language literature for children and young people from various media and genres, including prose and poetry
nb: lese og fortelle om engelskspråklig barne- og ungdomslitteratur fra ulike medier og sjangere, inkludert prosa og dikt

source: hand tools and joining techniques for wood, clay and textiles in a safe and environmentally friendly way
nb: håndverktøy og sammenføyningsteknikker i tre, leire og tekstil på en miljøbevisst og trygg måte

source: This is how the two researchers, Marit Bøe and Karin Hognestad, describe an ordinary morning in a kindergarten.
nb: Dette er beskrivelsen de to forskerne Marit Bøe og Karin Hognestad gir av en vanlig morgen i en barnehage.

source: discuss literature by and about indigenous peoples in the English-speaking world
nb: drøfte litteratur av og om urfolk i den engelskspråklige verden

source: The main subject area also covers independence and conditioned probability, random and non-random selection and binomial and hypergeometric probability models.
nb: I tillegg omfatter hovedområdet uavhengighet og betinget sannsynlighet, ordnede og ikke-ordnede utvalg og binomiske og hypergeometriske sannsynlighetsmodeller.

source: use the language through several senses and media
nb: bruke språket gjennom flere sanser og medier

source: Writing in art and crafts involves being able to communicate visually through signs and symbols.
nb: Å kunne skrive i kunst og håndverk er å kommunisere visuelt gjennom tegn og symboler.

source: It also means using digital tools to develop models, calculate values, reformulate expressions and scaling.
nb: Eier du flere SFO-er må du finne en balanse mellom den enkelte SFOs behov og samlet behov for dine SFO-er.

source: This is where knowledge about kindergarten content and social interaction is created and shared.
nb: Her deles og skapes det kunnskap om barnehagens innhold og om sosiale samspill.

source: deal with proportional and inversely proportional magnitudes in practical contexts
nb: behandle proporsjonale og omvendt proporsjonale størrelser i praktiske sammenhenger

source: more contagious strains of the virus increase the likelihood of cases at kindergartens and schools because
nb: Med nye, mer smittsomme virusvarianter er det større sannsynlighet for tilfeller i barnehager og skoler

source: The pupils shall have the opportunity to experiment.
nb: gjøre rede for tanker og ideologier som har ligget til grunn for politiske

source: Oral skills in Social science are practiced within a process that starts with the ability to back up one’s remarks with references, often based on personal opinions, which develop into relevant themes and specific terminology and using reason with an increasing degree of argumentation, discussion and precise use of professional and academic terminology.
nb: Muntlige ferdigheter i samfunnsfag blir oppøvd i en prosess som starter med refererende ytringer, ofte av personlig karakter, og blir utviklet til fagrelevante og fagspesifikke tankerekker med økende grad av argumentasjon, drøfting og presis bruk av fagbegreper.

source: The education shall promote the versa-tile development of the pupils and their knowledge and skil s.
nb: Opplæringen skal fremme elevenes al sidige utvikling og deres kunnskaper og ferdigheter.

source: ✹ stimulate the stamina, curiosity and desire of pupils and apprentices/
nb: ✹ stimulere elevenes og lærlingenes/lærekandidatenes lærelyst, utholdenhet

source: explain and assess what can be done to reduce uncertainties of measurements and avoid any possible source errors from measurements and results
nb: forklare og vurdere hva som kan gjøres for å redusere usikkerhet og feilkilder i målingar og resultater

source: understand oral and written presentations about general and specialised themes related to his/her own education programme
nb: forstå og bruke et bredt ordforråd og/eller tegnforråd innen BSL/ASL knyttet til generelle emner og til eget utdanningsprogram

source: give an account of central stories from the New Testament from Jesus to the prophets
nb: gjøre rede for sentrale fortellinger fra Det nye testamente fra Jesus til Paulus

source: use concepts from the social sciences in academic discussions and presentations using different kinds of digital tools and build further on contributions from others
nb: bruke samfunnsfaglige begreper i fagsamtaler og presentasjoner med ulike digitale verktøy og bygge videre på andres bidrag

source: Formative assessment shall help to promote learning and to develop competence in the mathematics subject.
nb: Underveisvurderingen skal bidra til å fremme læring og til å utvikle kompetanse i matematikk.

source: This also applies to the understanding of form, system and composition.
nb: Det gjelder også forståelse for form, system og komposisjon.

source: ‘Many elements from Sámi educational theory have now been incorporated as new chapters in the Framework Plan.
nb: – Mange momenter i den samiske pedagogikken er nå tatt inn i flere kapitler i rammeplanen.

source: write basic texts about social science themes and use basic terminology from the field
nb: skrive enkle tekster om samfunnsfaglige tema og bruke grunnleggende fagbegreper

source: write creative, informative, reflective and persuasive texts with justified opinions adapted for a given recipient and purpose
nb: uttrykke seg skriftlig med presisjon og sammenheng og benytte et variert og nyansert ordforråd og ulike setningskonstruksjoner i eget skrivearbeid

source: apply their knowledge of rhetorical appeals in discussions and presentations
nb: presentere faglige emner og gi tilbakemelding på andres presentasjoner

source: Sociology and economics are integrated in each main subject area.
nb: Samfunnskunnskap og økonomi blir integrert i hvert hovedområde.

source: employ rules for orthography, punctuation and sentence structure when writing
nb: bruke regler for ortografi, tegnsetting og setningsstruktur i egen skriving

source: explain and adopt fundamental principles of data protection and copyright when publishing and using texts
nb: forklare og bruke grunnleggende prinsipper for personvern og opphavsrett ved publisering og bruk av tekster

source: understand and apply linguistic knowledge and terms when discussing texts and language
nb: forstå og bruke norskfaglige kunnskaper og begreper i samtaler om tekst og språk

source: apply their knowledge of texts, media and linguistic devices in their own writing
nb: bruke kunnskap om tekst, sjanger, medium og språklige virkemidler i egen skriving

source: use a wide selection of digital and other aids independently, including monolingual dictionaries
nb: vurdere ulike digitale ressurser og andre hjelpemidler kritisk og selvstendig og bruke dem i egen språklæring

source: For this reason, about half of the teaching time of the subject will be used for Knowledge of Christianity.
nb: Om lag halvparten av undervisningstiden i faget skal av den grunn brukes på kristendomskunnskap.

source: The main subject area covers locating and extending natural and man-made conditions on earth, and intends to stimulate an understanding of how and why these influence one another.
nb: Hovedområdet omfatter lokalisering og utbredelse av naturlige og menneskeskapte forhold på jorda, og skal stimulere til forståelse av hvordan og hvorfor disse påvirker hverandre.

source: evaluate, select and use mathematical methods and tools to solve problems from different subjects and social areas and reflect on, evaluate and present solutions in a purposeful manner
nb: vurdere, velge og bruke matematiske metoder og verktøy til å løse problemer fra ulike fag og samfunnsområder, og reflektere over, vurdere og presentere løsningene på en hensiktsmessig måte

source: The main subject area deals with knowledge about the English language and the choosing and assessment of different strategies for promoting personal language learning.
nb: Hovedområdet dreier seg om kunnskap om det engelske språket og valg og vurdering av ulike strategier for å fremme egen språklæring.

source: give an account of the reasons for the development of the Knowledge and Information Society, and discuss the effects of this development on the individual and on society at large
nb: gjøre rede for årsaker til utviklingen av kunnskaps- og informasjonssamfunnet og diskutere virkninger av denne utviklingen for individ og samfunn

source: Viral diseases are highly contagious.
nb: Virussykdommer er svært smittsomme.

source: document and give an account of how Norwegian Sign Language has been influenced and changed over time
nb: dokumentere hvordan norsk tegnspråk har blitt påvirket og endret over tid

source: in social studies means telling other about events in the past and the present, explaining about places and facts and applying definitions, concepts and terms to explain causes and effects in connection with society and culture.
nb: i samfunnsfag innebærer å fortelle om hendelser i fortid og samtid, å beskrive steder og fakta og bruke definisjoner, begreper og faguttrykk til å forklare årsaker og virkninger knyttet til samfunn og kultur.

source: This subject is a common core subject for all the upper secondary education programmes.
nb: Faget er et fellesfag for alle utdanningsprogrammene i videregående opplæring.

source: To discuss means to consider different ideas and opinions related to sides of an issue, and to argue for and against.
nb: Å drøfte er å belyse en sak ved å trekke fram forskjellige sider av den, og argumentere både for og imot.

source: talk about Christianity and how religious practice is expressed in maxims, rules of conduct, prayer, baptism, church worship and holidays
nb: samtale om kristendom og hvordan religiøs praksis kommer til uttrykk gjennom leveregler, bønn, dåp, gudstjeneste og høytider

source: repair and maintain different types of surfaces
nb: reparere og vedlikeholde ulike typer overflater

source: assess and comment on his/her progress in learning English
nb: vurdere og kommentere egen framgang i arbeidet med å lære engelsk

source: Before the teaching begins, a decision shall be made for each pupil as to what level in the curriculum the teaching shall serve as a starting point.
nb: Før opplæringen starter, må det vurderes og tas standpunkt til hvilket nivå i læreplanen opplæringen skal ta utgangspunkt i for den enkelte elev.

source: listen to and talk about texts and stories that express a humanistic worldview nb
nb: lytte til og samtale om tekster og fortellinger som uttrykker et humanistisk livssyn

source: find median, mode and averages for simple data sets and assess them in relation to each other
nb: finne median, typetall og gjennomsnitt i enkle datasett og vurdere de ulike sentralmålene i forhold til hverandre

source: The use of digital tools also involves being able to make calculations by means of a spreadsheet program.
nb: Bruk av digitale verktøy innebærer også å gjøre beregninger ved hjelp av regnearkprogram.

source: in Landscaper and Sports Facilities Operator studies involves calculating length, area, volume and weight in connection with different work operations.
nb: i anleggsgartner- og idrettsanleggsfag innebærer å beregne lengde, areal, volum og vekt i forbindelse med ulike arbeidsoperasjoner.

source: in Communication and culture involves identifying geometrical forms and mathematical symbols in texts.
nb: i kommunikasjon og kultur innebærer å identifisere geometriske former og matematiske symboler i tekster.

source: give an account of how different media create different conditions for communication
nb: gjøre rede for hvordan ulike medier skaper ulike forutsetninger for kommunikasjon

source: navigate large volumes of text of varying complexity and select, summarise and evaluate relevant information
nb: orientere seg i store mengder tekst av ulik kompleksitet og velge, sammenfatte og vurdere relevant informasjon

source: Who does what in kindergartens?
nb: Hvem gjør hva i barnehagen?

source: ‘The Chinese kindergarten uses the walls more actively than what we are used to doing in Scandinavia’, comments Birkeland.
nb: Den kinesiske barnehagen bruker veggene mer aktivt enn det vi er vant til i Skandinavia, mener Birkeland.

source: select and evaluate information from the library and digital information channels
nb: bruke digitale skriveverktøy i skriveprosesser og i produksjon av interaktive tekster

source: Teaching in the programme subjects shall embrace the broadness of the Norwegian aquaculture industry in terms of species, types of installations and modes of operation.
nb: Opplæringen i programfagene skal favne bredden i norsk akvakulturnæring når det gjelder arter, anleggstyper og driftsformer.

source: take care of plants and vegetation in facilities, recreational areas, and natural and cultural landscapes
nb: utføre skjøtsel av plantemateriale og vegetasjonsarealer i anlegg, rekreasjonsområder, natur- og kulturlandskaper

source: explain the connections between quality in workmanship and subsequent maintenance work on facilities
nb: utføre arbeid i nyanlegg med tanke på økonomi og ressursutnyttelse og i tråd med gjeldende regelverk og standarder

source: Fortunately, there are many adults in the lives of Sámi children.
nb: Heldigvis er det mange voksne i livet til et samisk barn.

source: talk about Hinduism, the Hindu manner of viewing life and ethics with an emphasis on some of their gods and goddesses, their manner of viewing existence and divinity, of viewing humanity, current ethical challenges and selected texts
nb: samtale om hinduisme, hinduistisk livstolkning og etikk med vekt på noen guder og gudinner, synet på tilværelsen og det guddommelige, menneskesyn, aktuelle etiske utfordringer og utvalgte tekster

source: The main goal of the teaching is to strengthen pupils’ qualifications for gaining a command of the Norwegian language and thus enhance their learning options through the development of fundamental reading and writing skills, vocabulary and comprehension of terms and concepts in their mother tongue.
nb: Hovedformålet med opplæringen er å styrke elevenes forutsetninger for å beherske det norske språket og derved deres læringsmuligheter gjennom utvikling av grunnleggende lese- og skriveferdigheter, ordforråd og begrepsforståelse på morsmålet.

source: It includes the knowledge of fundamental characteristics of English usage, as well as the relationship between language, culture and society, and the use of linguistic tools and stylistic devices in literary texts.
nb: Det omfatter kunnskap om grunnleggende trekk ved engelsk språkbruk og sammenhengen mellom språk, kultur og samfunn og bruk av språklige virkemidler og stilistiske trekk i litterære tekster.

source: The researchers canvassed parents and early childhood educators for their opinions on this matter.
nb: Forskerne har spurt foreldre og barnehagelærere hva de tenker om denne situasjonen.

source: Identifying different modes of thought and how these have influenced human beings and society can help pupils to better understand the times in which we live.
nb: Å kunne identifisere ulike tenkemåter og hvordan de har påvirket mennesker og samfunn, kan bidra til at eleven forstår samtiden bedre.

source: master and explain the principles of simple communication in International Sign – IS
nb: beherske og forklare prinsippene i enkel kommunikasjon på ”International Sign” - IS

source: Basic skills are integrated into the competence aims, where they are part of the technical competence and assist in its development.
nb: Grunnleggende ferdigheter i faget er integrert i kompetansemålene der de bidrar til utvikling av og er en del av fagkompetansen.

source: The children might be missing out on some of the technology content in the ECEC institution, and even on some of the material in the curriculum.
nb: Barna kan gå glipp av deler av teknologiinnholdet i barnehagen, og til og med deler av stoffet i læreplanen.

source: obtain, evaluate and use technical material and information from digital sources when working on own texts and observe the rules on data protection and copyright
nb: kombinere muntlige, skriftlige, tegnspråklige og andre visuelle og auditive uttrykksformer i egen tekstproduksjon og ved framføringer og presentasjoner

source: Virus and bacteria are the most common causes of infectious diseases
nb: Virus og bakterier er de vanligste årsakene til infeksjonssykdommer

source: Central to the main subject area are underlying cultural values in various forms of communication, and communicative challenges facing those with different cultural backgrounds.
nb: Sentralt i hovedområdet er underliggende kulturelle verdier i ulike former for kommunikasjon, og utfordringer i kommunikasjon mellom personer med ulik kulturbakgrunn.

source: understand the meaning of words and phrases based on the context they are used in
nb: forstå betydningen av ord og uttrykk ut fra sammenhengen disse er brukt i

source: Swedish researchers are finding that the notion of care is in the process of disappearing in preschools.
nb: Begrepet omsorg er i ferd med å bli borte i barnehagen, mener svenske forskere.

source: Chemistry - programme subject in Programmes for Specialization in General Studies (KJE1-01)
nb: Læreplan i kjemi - programfag i utdanningsprogram for studiespesialisering (KJE1-01)

source: Analysis of Norwegian data from the TIMSS Advanced study of students in 3MX appears to point in the same direction.
nb: Analyser av norske data fra TIMSS Advanced-studien av elever i 3MX synes å peke i samme retning.

source: Gender differences in mathematics in TIMSS Advanced
nb: Kjønnsforskjeller i matematikk i TIMSS Advanced

source: Where alliances are built, one risks being left outside.
nb: Og der det bygges allianser, risikerer noen å bli stående utenfor.

source: Sociogeographical tools and methods
nb: samfunnsgeografiske verktøy og metoder

source: It also involves being able to read graphic presentations, tables and statistics.
nb: Det dreier seg også om å kunne lese grafiske framstillinger, tabeller og statistikk.

source: intended to strengthen the learning-promoting aims of assess-ment.
nb: det læringsfremjande føremålet med vurderinga.

source: Geosciences 1 also comprises the main subject area Geosciences Research.
nb: Geofag 1 omfatter i tillegg hovedområdet geoforskning.

source: normal organisation of the school day (green level) to extensive measures that entail smaller groups and
nb: organisering av barnehagehverdag og lek (grønt nivå), til mer omfattende tiltak med små, faste grupper av

source: This is what the researcher brands an “undecidable moment”, and it disrupts staff members’ thoughts about educational work.
nb: Det er dette forskeren kaller et «ubestemmelig øyeblikk», som forstyrrer barnehagepersonalets tenkning om pedagogisk arbeid.

source: These are necessary in order for circle time to be more than routine.
nb: De er nødvendige for at samlingsstundene skal bli mer enn rutine.

source: The two researchers also found that about 10 per cent of the children in the survey experience a low degree of well-being.
nb: De to forskerne fant også ut at rundt 10 prosent av barna i undersøkelsen trivdes dårlig.

source: cite the Rule of Reciprocity and be able to put this rule into practice
nb: samtale om respekt og toleranse og motvirke mobbing i praksis

source: One of the kindergartens visited by the researchers features Reggio Emilia-inspired pedagogy, where it is important that children are given support for their exploration of the world.
nb: En av barnehagene forskerne besøkte, hadde en Reggio Emilia-inspirert pedagogikk, der det er viktig at barna støttes i sin utforskning av verden.

source: Algebra is also used in connection with the other main subject areas.
nb: Algebra benyttes også i forbindelse med hovedområdene geometri og funksjoner.

source: researchers asked early childhood educators and parents in an effort to determine whether the two groups have different attitudes to specific pedagogical questions.
nb: forskere har stilt til barnehagelærere og foreldre da de ville finne ut om de to gruppene har ulike holdninger til pedagogiske spørsmål.
